src/Catalogs/док_БД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>док_БД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддержка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_ПоддержкаКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_ТипБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьК_БД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Кластеры1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_ВерсииКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпубликованаНаWebСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_WEBСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_СУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИБ_В_СУБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиБД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольЗашифрован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>WebСервисы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.док_ТипыВебСервисов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.док_ХранилищаКонфигураций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/док_ТипБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>док_ТипБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентСерверная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/док_ТипыВебСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>док_ТипыВебСервисов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTTPСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/док_БД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипБДСервер();
	СформироватьСтрокуСоединения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьWebСервер();
КонецПроцедуры   

&НаКлиенте
Процедура ТипБДПриИзменении(Элемент)
	ТипБДСервер();
	СформироватьСтрокуСоединения();
КонецПроцедуры

&НаСервере
Процедура ТипБДСервер()	
	Если НЕ Объект.ТипБД.Пустая() Тогда 
		КлиентСерверБД = Объект.ТипБД = Перечисления.док_ТипБД.КлиентСерверная;
		Элементы.ГрСервернаяИБ.Видимость = КлиентСерверБД;
		Элементы.СУБД.Видимость = КлиентСерверБД;
		Элементы.ПутьК_БД.Видимость = НЕ КлиентСерверБД;
		Элементы.ГруппаСерверСУБД.Группировка = ?(КлиентСерверБД,ГруппировкаПодчиненныхЭлементовФормы.Вертикальная,ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликованаНаWebСервереПриИзменении(Элемент)
	ВидимостьWebСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьWebСервер()	
	Элементы.WebСервер.Видимость = Объект.ОпубликованаНаWebСервере;
	Элементы.АдресПубликации.Видимость = Объект.ОпубликованаНаWebСервере;
	Элементы.ГруппаWebПубликация.Видимость = Объект.ОпубликованаНаWebСервере;
КонецПроцедуры

&НаКлиенте
Процедура СУБДПриИзменении(Элемент)
	СУБДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СУБДПриИзмененииНаСервере()
	Объект.Контрагент = Объект.Сервер.Сервер.Контрагент;
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокуСоединения()
	Если Объект.ТипБД = Перечисления.док_ТипБД.Файловая Тогда
		СтрокаСоединения = "Connect=File=""" + Объект.ПутьК_БД + """";
	Иначе	
		СтрокаСоединения = "Connect=Srvr=""" + Объект.Сервер.Наименование + """;Ref=""" + Объект.ИмяИБ + """";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяИБПриИзменении(Элемент)
	СформироватьСтрокуСоединения();
	Объект.ИмяИБ_В_СУБД = ?(Объект.ИмяИБ_В_СУБД = "",Объект.ИмяИБ,Объект.ИмяИБ_В_СУБД);
КонецПроцедуры

&НаКлиенте
Процедура ПутьК_БДПриИзменении(Элемент)
	СформироватьСтрокуСоединения();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИмяИБ(Команда)
	Объект.ИмяИБ_В_СУБД = Объект.ИмяИБ;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзVRD_Файла(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект),"Перед загрузкой табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ОКОтмена,30,КодВозвратаДиалога.Отмена,"Заполнить таблицу из vrd файла" ,КодВозвратаДиалога.ОК);	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДВФ.Фильтр = НСтр("ru = ""Текст""; en = ""Text""")+"(*.vrd)|*.vrd"; 
		ДВФ.МножественныйВыбор = Ложь; 
		ДВФ.Заголовок = "Выберите файл default.vrd";
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора( Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение",ЭтотОбъект),ДВФ);
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
    ФайлНастроек = Результат[0];
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(ФайлНастроек);
	Попытка
		VRD = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		Объект.WebСервисы.Очистить();
		WebСервис = ПредопределенноеЗначение("Перечисление.док_ТипыВебСервисов.WebСервис");
		Для каждого вс из VRD.ws.point Цикл
			СтрВС = Объект.WebСервисы.Добавить();		
			СтрВС.Тип = WebСервис;
			СтрВС.Название = вс.name;		
			СтрВС.Адрес = вс.alias;
			СтрВС.Включен = ?(вс.enable = "true",Истина,Ложь);
		КонецЦикла;
		HTTPСервис = ПредопределенноеЗначение("Перечисление.док_ТипыВебСервисов.HTTPСервис");
		Для каждого вс из VRD.httpServices.service Цикл
			СтрВС = Объект.WebСервисы.Добавить();		
			СтрВС.Тип = HTTPСервис;
			СтрВС.Название = вс.name;		
			СтрВС.Адрес = вс.rootUrl;
			СтрВС.Включен = ?(вс.enable = "true",Истина,Ложь);
		КонецЦикла;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка чтения файла.");
	КонецПопытки;		
	
КонецПроцедуры
